{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[],"authorship_tag":"ABX9TyMQ5fnd4/cl64GPCl18zSMY"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"markdown","source":["Нужно написать программу для формирования списка покупок\n"],"metadata":{"id":"F3tXb2gKt7fy"}},{"cell_type":"code","execution_count":4,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"vbj4w1-vtr4J","executionInfo":{"status":"ok","timestamp":1721926007466,"user_tz":-180,"elapsed":43893,"user":{"displayName":"Артур Артиков","userId":"02303814087280081703"}},"outputId":"305ae6a9-6e60-4212-d254-57139ecfca33"},"outputs":[{"output_type":"stream","name":"stdout","text":["\n","Это программа Список покупок.\n","Для формирования списка покупок\n","присылайте названия продуктов в\n","отдельных сообщениях.\n","\n","Чтобы завершить формирование списка\n","покупок отправьте в сообщении слово \n","\"Конец\".\n","Введите название товара: Мука\n","Введите название товара: молоко\n","Введите название товара: яблоки\n","Введите название товара: карТОФЕЛЬ\n","Введите название товара: ФалафеЛЬ\n","Введите название товара: Говядина\n","Введите название товара: Мороженое\n","Введите название товара: яйца\n","Введите название товара: Сливочное масло\n","Введите название товара: КОНЕЦ\n","\n","Список покупок:\n","Мука\n","Молоко\n","Яблоки\n","Картофель\n","Фалафель\n","Говядина\n","Мороженое\n","Яйца\n","Сливочное масло\n","Конец\n"]}],"source":["print('''\n","Это программа Список покупок.\n","Для формирования списка покупок\n","присылайте названия продуктов в\n","отдельных сообщениях.\n","\n","Чтобы завершить формирование списка\n","покупок отправьте в сообщении слово\n","\"Конец\".''')\n","\n","shopping_list = []\n","element = ''\n","\n","while element != 'Конец':\n","  element = input('Введите название товара: ').capitalize()\n","  shopping_list.append(element)\n","else:\n","  print('\\nСписок покупок:')\n","  print(*shopping_list, sep='\\n')"]}]}